---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.OnlyOneSlopeCurtainRoof
source: html/c1d9a99c-0953-bfca-88ea-f57e9623f824.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.OnlyOneSlopeCurtainRoof Property

Only one slope in curtain roof.

## Syntax (C#)
```csharp
public static FailureDefinitionId OnlyOneSlopeCurtainRoof { get; }
```